``` sql
create table student(name varchar(50));
insert into student values('Vikram,Reddy');
insert into student values('Reddy,Vikram');
insert into student values('Aman,Kumar');
insert into student values('Kumar,Aman');

select * from student;

+--------------+
| name         |
+--------------+
| Vikram,Reddy |
| Reddy,Vikram |
| Aman,Kumar   |
| Kumar,Aman   |
+--------------+

Question:
Q. By mistake, the user has inserted 2 records for the same employee in the below format:
Firstname,Lastname and LastName,FirstName
Write an SQL query to display the unique records only.

Expected Output:
+--------------+
| name         |
+--------------+
| Reddy,Vikram |
| Aman,Kumar   |
+--------------+
```
---

#### **Solution-1:**

``` sql
select concat(first_name,',', last_name) as name 
from
(
select SUBSTRING_INDEX(name,',',1) as first_name,
SUBSTRING_INDEX(name,',',-1) as last_name
from student
)a
where first_name < last_name;
```
---

#### **Solution-2:**
``` sql
with name_split as
(select 
 substring(name, 1, position(',' in name)-1) as name_1 ,
 substring(name, position(',' in name)+1, length(name)) as name_2
from student) ,

dup_removed as
(select distinct
 least(name_1, name_2) as per_1,
 greatest(name_1, name_2) as per_2
from name_split)

select
 concat(per_1, ",", per_2) as name
from dup_removed;
```
---